; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	image2 - mode
	GroundStation3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 196)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 158)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 184)
	(= (data Phenomenon5 spectrograph1) 30)
	(= (data Planet6 spectrograph1) 253)
	(= (data Planet7 spectrograph1) 192)
	(= (data Phenomenon8 spectrograph1) 214)
	(= (data Phenomenon5 thermograph0) 294)
	(= (data Planet6 thermograph0) 210)
	(= (data Planet7 thermograph0) 239)
	(= (data Phenomenon8 thermograph0) 281)
	(= (data Phenomenon5 image2) 142)
	(= (data Planet6 image2) 283)
	(= (data Planet7 image2) 84)
	(= (data Phenomenon8 image2) 97)
	(= (slew_time GroundStation3 GroundStation0) 34.65)
	(= (slew_time GroundStation0 GroundStation3) 34.65)
	(= (slew_time GroundStation3 Star1) 14.8)
	(= (slew_time Star1 GroundStation3) 14.8)
	(= (slew_time GroundStation3 Star2) 59.64)
	(= (slew_time Star2 GroundStation3) 59.64)
	(= (slew_time Star1 GroundStation0) 34.78)
	(= (slew_time GroundStation0 Star1) 34.78)
	(= (slew_time Star2 GroundStation0) 61.2)
	(= (slew_time GroundStation0 Star2) 61.2)
	(= (slew_time Star2 Star1) 32.89)
	(= (slew_time Star1 Star2) 32.89)
	(= (slew_time Star4 GroundStation0) 49.11)
	(= (slew_time GroundStation0 Star4) 49.11)
	(= (slew_time Star4 Star1) 61.72)
	(= (slew_time Star1 Star4) 61.72)
	(= (slew_time Star4 Star2) 44.22)
	(= (slew_time Star2 Star4) 44.22)
	(= (slew_time Star4 GroundStation3) 2.528)
	(= (slew_time GroundStation3 Star4) 2.528)
	(= (slew_time Phenomenon5 GroundStation0) 42.3)
	(= (slew_time GroundStation0 Phenomenon5) 42.3)
	(= (slew_time Phenomenon5 Star1) 18.25)
	(= (slew_time Star1 Phenomenon5) 18.25)
	(= (slew_time Phenomenon5 Star2) 10.41)
	(= (slew_time Star2 Phenomenon5) 10.41)
	(= (slew_time Phenomenon5 GroundStation3) 72.53)
	(= (slew_time GroundStation3 Phenomenon5) 72.53)
	(= (slew_time Phenomenon5 Star4) 58.26)
	(= (slew_time Star4 Phenomenon5) 58.26)
	(= (slew_time Planet6 GroundStation0) 27.02)
	(= (slew_time GroundStation0 Planet6) 27.02)
	(= (slew_time Planet6 Star1) 27.85)
	(= (slew_time Star1 Planet6) 27.85)
	(= (slew_time Planet6 Star2) 3.464)
	(= (slew_time Star2 Planet6) 3.464)
	(= (slew_time Planet6 GroundStation3) 3.841)
	(= (slew_time GroundStation3 Planet6) 3.841)
	(= (slew_time Planet6 Star4) 63.05)
	(= (slew_time Star4 Planet6) 63.05)
	(= (slew_time Planet6 Phenomenon5) 40.65)
	(= (slew_time Phenomenon5 Planet6) 40.65)
	(= (slew_time Planet7 GroundStation0) 51.69)
	(= (slew_time GroundStation0 Planet7) 51.69)
	(= (slew_time Planet7 Star1) 0.3192)
	(= (slew_time Star1 Planet7) 0.3192)
	(= (slew_time Planet7 Star2) 42.38)
	(= (slew_time Star2 Planet7) 42.38)
	(= (slew_time Planet7 GroundStation3) 7.71)
	(= (slew_time GroundStation3 Planet7) 7.71)
	(= (slew_time Planet7 Star4) 8.714)
	(= (slew_time Star4 Planet7) 8.714)
	(= (slew_time Planet7 Phenomenon5) 48.61)
	(= (slew_time Phenomenon5 Planet7) 48.61)
	(= (slew_time Planet7 Planet6) 31.52)
	(= (slew_time Planet6 Planet7) 31.52)
	(= (slew_time Phenomenon8 GroundStation0) 67.74)
	(= (slew_time GroundStation0 Phenomenon8) 67.74)
	(= (slew_time Phenomenon8 Star1) 13.97)
	(= (slew_time Star1 Phenomenon8) 13.97)
	(= (slew_time Phenomenon8 Star2) 19.26)
	(= (slew_time Star2 Phenomenon8) 19.26)
	(= (slew_time Phenomenon8 GroundStation3) 28.71)
	(= (slew_time GroundStation3 Phenomenon8) 28.71)
	(= (slew_time Phenomenon8 Star4) 32.03)
	(= (slew_time Star4 Phenomenon8) 32.03)
	(= (slew_time Phenomenon8 Phenomenon5) 14.85)
	(= (slew_time Phenomenon5 Phenomenon8) 14.85)
	(= (slew_time Phenomenon8 Planet6) 53.72)
	(= (slew_time Planet6 Phenomenon8) 53.72)
	(= (slew_time Phenomenon8 Planet7) 12.07)
	(= (slew_time Planet7 Phenomenon8) 12.07)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet6)
	(have_image Phenomenon5 spectrograph1)
	(have_image Planet6 image2)
	(have_image Planet7 image2)
	(have_image Phenomenon8 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 planet6 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 184 to 156.98, (fuel-used) from 0 to 27.02
   goals met: 1 of 5
2. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 196 to 163.11, (fuel-used) from 27.02 to 59.91
   goals met: 1 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 163.11 to 149.14, (fuel-used) from 59.91 to 73.88
   goals met: 1 of 5
6. (turn_to satellite2 groundstation3 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation3)
   changed: (fuel satellite2) from 156.98 to 153.139, (fuel-used) from 73.88 to 77.721
   goals met: 0 of 5
7. (take_image satellite0 phenomenon8 instrument0 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 719, (data-stored) from 0 to 281
   goals met: 1 of 5
8. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 149.14 to 134.29, (fuel-used) from 77.721 to 92.571
   goals met: 1 of 5
9. (turn_to satellite2 planet6 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 153.139 to 149.298, (fuel-used) from 92.571 to 96.412
   goals met: 2 of 5
10. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 158 to 149.286, (fuel-used) from 96.412 to 105.126
   goals met: 2 of 5
11. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 5
12. (turn_to satellite2 star4 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 149.298 to 86.248, (fuel-used) from 105.126 to 168.176
   goals met: 1 of 5
13. (calibrate satellite2 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 1 of 5
14. (turn_to satellite2 planet6 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 86.248 to 23.198, (fuel-used) from 168.176 to 231.226
   goals met: 2 of 5
15. (take_image satellite0 phenomenon5 instrument0 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   changed: (data_capacity satellite0) from 719 to 689, (data-stored) from 281 to 311
   goals met: 3 of 5
16. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 5
17. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 149.286 to 140.572, (fuel-used) from 231.226 to 239.94
   goals met: 3 of 5
18. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 3 of 5
19. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 140.572 to 131.858, (fuel-used) from 239.94 to 248.654
   goals met: 3 of 5
20. (take_image satellite2 planet6 instrument4 image2)
   added: (have_image planet6 image2)
   changed: (data_capacity satellite2) from 1000 to 717, (data-stored) from 311 to 594
   goals met: 4 of 5
21. (take_image satellite1 planet7 instrument3 image2)
   added: (have_image planet7 image2)
   changed: (data_capacity satellite1) from 1000 to 916, (data-stored) from 594 to 678
   goals met: 5 of 5
